# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterSet..::..Erase Method
ParameterSet Class See Also
---
Removes a specified parameter from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	Parameter item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As Parameter _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	Parameter^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ParameterThe parameter to be erased.
# ### Return Value
The number of parameters that were erased from the set.
# See Also
ParameterSet Class
Autodesk.Revit.DB Namespace